gertvb/LPC55S69_GuiGuider/LPC55S69_LVGL_GUI_GUIDER/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPins(void)
{
    /* Enables the clock for the Input Mux.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_InputMux);
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t SW_ISP_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_5 (pin 88)  */
    GPIO_PinInit(BOARD_INITPINS_SW_ISP_GPIO, BOARD_INITPINS_SW_ISP_PORT, BOARD_INITPINS_SW_ISP_PIN, &SW_ISP_config);

    gpio_pin_config_t Rotary_SW_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_13 (pin 71)  */
    GPIO_PinInit(BOARD_INITPINS_Rotary_SW_GPIO, BOARD_INITPINS_Rotary_SW_PORT, BOARD_INITPINS_Rotary_SW_PIN, &Rotary_SW_config);

    gpio_pin_config_t Rotary_B_Level_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_27 (pin 27)  */
    GPIO_PinInit(BOARD_INITPINS_Rotary_B_Level_GPIO, BOARD_INITPINS_Rotary_B_Level_PORT, BOARD_INITPINS_Rotary_B_Level_PIN, &Rotary_B_Level_config);

    gpio_pin_config_t LED_Red_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_4 (pin 1)  */
    GPIO_PinInit(BOARD_INITPINS_LED_Red_GPIO, BOARD_INITPINS_LED_Red_PORT, BOARD_INITPINS_LED_Red_PIN, &LED_Red_config);

    gpio_pin_config_t LED_Blue_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_6 (pin 5)  */
    GPIO_PinInit(BOARD_INITPINS_LED_Blue_GPIO, BOARD_INITPINS_LED_Blue_PORT, BOARD_INITPINS_LED_Blue_PIN, &LED_Blue_config);

    gpio_pin_config_t LED_Green_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_7 (pin 9)  */
    GPIO_PinInit(BOARD_INITPINS_LED_Green_GPIO, BOARD_INITPINS_LED_Green_PORT, BOARD_INITPINS_LED_Green_PIN, &LED_Green_config);

    gpio_pin_config_t SW_User_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_9 (pin 10)  */
    GPIO_PinInit(BOARD_INITPINS_SW_User_GPIO, BOARD_INITPINS_SW_User_PORT, BOARD_INITPINS_SW_User_PIN, &SW_User_config);

    gpio_pin_config_t SW_Wake_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_18 (pin 64)  */
    GPIO_PinInit(BOARD_INITPINS_SW_Wake_GPIO, BOARD_INITPINS_SW_Wake_PORT, BOARD_INITPINS_SW_Wake_PIN, &SW_Wake_config);

    gpio_pin_config_t Rotary_A_Level_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_24 (pin 3)  */
    GPIO_PinInit(BOARD_INITPINS_Rotary_A_Level_GPIO, BOARD_INITPINS_Rotary_A_Level_PORT, BOARD_INITPINS_Rotary_A_Level_PIN, &Rotary_A_Level_config);

    gpio_pin_config_t TFT_Reset_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_26 (pin 68)  */
    GPIO_PinInit(BOARD_INITPINS_TFT_Reset_GPIO, BOARD_INITPINS_TFT_Reset_PORT, BOARD_INITPINS_TFT_Reset_PIN, &TFT_Reset_config);

    gpio_pin_config_t TFT_Data_or_Command_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_27 (pin 85)  */
    GPIO_PinInit(BOARD_INITPINS_TFT_Data_or_Command_GPIO, BOARD_INITPINS_TFT_Data_or_Command_PORT, BOARD_INITPINS_TFT_Data_or_Command_PIN, &TFT_Data_or_Command_config);
    /* PIO1_24 is selected for PINT input 0 */
    INPUTMUX_AttachSignal(INPUTMUX, 0U, kINPUTMUX_GpioPort1Pin24ToPintsel);
    /* PIO1_24 is selected for PINT input 1 */
    INPUTMUX_AttachSignal(INPUTMUX, 1U, kINPUTMUX_GpioPort1Pin24ToPintsel);
    /* PIO0_27 is selected for PINT input 2 */
    INPUTMUX_AttachSignal(INPUTMUX, 2U, kINPUTMUX_GpioPort0Pin27ToPintsel);
    /* PIO0_27 is selected for PINT input 3 */
    INPUTMUX_AttachSignal(INPUTMUX, 3U, kINPUTMUX_GpioPort0Pin27ToPintsel);

    IOCON->PIO[0][13] = ((IOCON->PIO[0][13] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT013 (pin 71) is configured as PIO0_13. */
                         | IOCON_PIO_FUNC(PIO0_13_FUNC_ALT0)

                         /* Selects function mode (on-chip pull-up/pull-down resistor control).
                          * : Pull-up.
                          * Pull-up resistor enabled. */
                         | IOCON_PIO_MODE(PIO0_13_MODE_PULL_UP)

                         /* Select Digital mode.
                          * : Enable Digital mode.
                          * Digital input is enabled. */
                         | IOCON_PIO_DIGIMODE(PIO0_13_DIGIMODE_DIGITAL));

    IOCON->PIO[0][26] = ((IOCON->PIO[0][26] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT026 (pin 60) is configured as HS_SPI_MOSI. */
                         | IOCON_PIO_FUNC(0x09u)

